Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # proxmox_virtual_environment_file.iso_image["1"] will be created
+ resource "proxmox_virtual_environment_file" "iso_image" {
      + content_type           = "iso"
      + datastore_id           = "backup-nas"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "prox2"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_file {
          + changed  = false
          + insecure = false
          + path     = "http://channels.nixos.org/nixos-23.05/latest-nixos-minimal-x86_64-linux.iso"
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[0] will be destroyed
  # (because proxmox_virtual_environment_vm.kube_wk is not in configuration)
- resource "proxmox_virtual_environment_vm" "kube_wk" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "550" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "76:55:0D:D7:81:AA",
        ] -> null
      - migrate                 = false -> null
      - name                    = "wk-polaris-0" -> null
      - network_interface_names = [] -> null
      - node_name               = "promox" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "k8s",
          - "terraform",
          - "wk",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 550 -> null

      - agent {
          - enabled = false -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - clone {
          - full      = true -> null
          - node_name = "prox2" -> null
          - retries   = 1 -> null
          - vm_id     = 1002 -> null
        }

      - disk {
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-550-disk-0" -> null
          - size              = 8 -> null
          - ssd               = false -> null
        }

      - initialization {
          - datastore_id = "local-lvm" -> null
          - interface    = "ide2" -> null

          - ip_config {
              - ipv4 {
                  - address = "192.168.2.120/32" -> null
                  - gateway = "192.168.2.1" -> null
                }
            }

          - user_account {
              - keys     = [
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ] -> null
              - password = (sensitive value) -> null
              - username = "ubuntu" -> null
            }
        }

      - network_device {
          - bridge      = "vmbr0" -> null
          - enabled     = true -> null
          - firewall    = false -> null
          - mac_address = "76:55:0D:D7:81:AA" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - queues      = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 0 -> null
        }

      - operating_system {
          - type = "l26" -> null
        }

      - serial_device {
          - device = "socket" -> null
        }

      - startup {
          - down_delay = 60 -> null
          - order      = 3 -> null
          - up_delay   = 60 -> null
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[1] will be destroyed
  # (because proxmox_virtual_environment_vm.kube_wk is not in configuration)
- resource "proxmox_virtual_environment_vm" "kube_wk" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "551" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "92:85:BC:2A:84:78",
        ] -> null
      - migrate                 = false -> null
      - name                    = "wk-polaris-1" -> null
      - network_interface_names = [] -> null
      - node_name               = "prox2" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "k8s",
          - "terraform",
          - "wk",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 551 -> null

      - agent {
          - enabled = false -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - clone {
          - full      = true -> null
          - node_name = "prox2" -> null
          - retries   = 1 -> null
          - vm_id     = 1002 -> null
        }

      - disk {
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-551-disk-0" -> null
          - size              = 8 -> null
          - ssd               = false -> null
        }

      - initialization {
          - datastore_id = "local-lvm" -> null
          - interface    = "ide2" -> null

          - ip_config {
              - ipv4 {
                  - address = "192.168.2.121/32" -> null
                  - gateway = "192.168.2.1" -> null
                }
            }

          - user_account {
              - keys     = [
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ] -> null
              - password = (sensitive value) -> null
              - username = "ubuntu" -> null
            }
        }

      - network_device {
          - bridge      = "vmbr0" -> null
          - enabled     = true -> null
          - firewall    = false -> null
          - mac_address = "92:85:BC:2A:84:78" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - queues      = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 0 -> null
        }

      - operating_system {
          - type = "l26" -> null
        }

      - serial_device {
          - device = "socket" -> null
        }

      - startup {
          - down_delay = 60 -> null
          - order      = 3 -> null
          - up_delay   = 60 -> null
        }
    }

  # proxmox_virtual_environment_vm.kube_wk[2] will be destroyed
  # (because proxmox_virtual_environment_vm.kube_wk is not in configuration)
- resource "proxmox_virtual_environment_vm" "kube_wk" {
      - acpi                    = true -> null
      - bios                    = "seabios" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "552" -> null
      - ipv4_addresses          = [] -> null
      - ipv6_addresses          = [] -> null
      - keyboard_layout         = "en-us" -> null
      - mac_addresses           = [
          - "B2:2D:95:57:54:F8",
        ] -> null
      - migrate                 = false -> null
      - name                    = "wk-polaris-2" -> null
      - network_interface_names = [] -> null
      - node_name               = "pve" -> null
      - on_boot                 = true -> null
      - reboot                  = false -> null
      - scsi_hardware           = "virtio-scsi-pci" -> null
      - started                 = false -> null
      - tablet_device           = true -> null
      - tags                    = [
          - "k8s",
          - "terraform",
          - "wk",
        ] -> null
      - template                = false -> null
      - timeout_clone           = 1800 -> null
      - timeout_create          = 1800 -> null
      - timeout_migrate         = 1800 -> null
      - timeout_move_disk       = 1800 -> null
      - timeout_reboot          = 1800 -> null
      - timeout_shutdown_vm     = 1800 -> null
      - timeout_start_vm        = 1800 -> null
      - timeout_stop_vm         = 300 -> null
      - vm_id                   = 552 -> null

      - agent {
          - enabled = true -> null
          - timeout = "15m" -> null
          - trim    = false -> null
          - type    = "virtio" -> null
        }

      - clone {
          - full      = true -> null
          - node_name = "prox2" -> null
          - retries   = 1 -> null
          - vm_id     = 1002 -> null
        }

      - disk {
          - cache             = "none" -> null
          - datastore_id      = "local-lvm" -> null
          - file_format       = "raw" -> null
          - interface         = "scsi0" -> null
          - iothread          = false -> null
          - path_in_datastore = "vm-552-disk-0" -> null
          - size              = 8 -> null
          - ssd               = false -> null
        }

      - initialization {
          - datastore_id = "local-lvm" -> null
          - interface    = "ide2" -> null

          - ip_config {
              - ipv4 {
                  - address = "192.168.2.122/32" -> null
                  - gateway = "192.168.2.1" -> null
                }
            }

          - user_account {
              - keys     = [
                  - "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDO4M863PiNN3BdJhQr/Gohwn9Hg3xIsUWvZ+ViM/w5LSDHOHOEkbFprRzLTpi0ZNYTkh1b3vY+tGm3gxuARUxedNrVEGEpn9xbrTXKwUA490rRC50I8UuYDzKd1rCF00m/HCUof8tgUiOkRXZV9I0LYuUItcTvpivXGr72j0qXRWc0coB/j06hpgf5Xi8sXuQ2xTcyu2xTifxuBDZB6sxeAcW43bQ99RajrPxlcjD+WZIyt/SZ6xY5tXEuvAzFpBhRaCXp9BA6KDghOWMjStZJICQkeLcXtMXeHZlicrpP/HTPHukh4hBckTHedqzVCCYzHZx6rY+5FlrI74AufVAH",
                ] -> null
              - password = (sensitive value) -> null
              - username = "ubuntu" -> null
            }
        }

      - network_device {
          - bridge      = "vmbr0" -> null
          - enabled     = true -> null
          - firewall    = false -> null
          - mac_address = "B2:2D:95:57:54:F8" -> null
          - model       = "virtio" -> null
          - mtu         = 0 -> null
          - queues      = 0 -> null
          - rate_limit  = 0 -> null
          - vlan_id     = 0 -> null
        }

      - operating_system {
          - type = "l26" -> null
        }

      - serial_device {
          - device = "socket" -> null
        }

      - startup {
          - down_delay = 60 -> null
          - order      = 3 -> null
          - up_delay   = 60 -> null
        }
    }

Plan: 1 to add, 0 to change, 3 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e779aff7675f:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 1 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`